; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	infrared3 - mode
	spectrograph1 - mode
	image4 - mode
	image0 - mode
	spectrograph2 - mode
	star10 - direction
	groundstation12 - direction
	groundstation16 - direction
	groundstation0 - direction
	star1 - direction
	groundstation2 - direction
	groundstation11 - direction
	groundstation13 - direction
	groundstation14 - direction
	groundstation15 - direction
	groundstation5 - direction
	groundstation8 - direction
	star6 - direction
	groundstation3 - direction
	groundstation9 - direction
	groundstation7 - direction
	star4 - direction
	phenomenon17 - direction
	planet18 - direction
	planet19 - direction
	planet20 - direction
	star21 - direction
	planet22 - direction
	phenomenon23 - direction
	star24 - direction
	star25 - direction
	phenomenon26 - direction
	star27 - direction
	star28 - direction
	planet29 - direction
	star30 - direction
	star31 - direction
	planet32 - direction
	phenomenon33 - direction
	phenomenon34 - direction
	planet35 - direction
	planet36 - direction
	planet37 - direction
	phenomenon38 - direction
	star39 - direction
	planet40 - direction
	star41 - direction
	planet42 - direction
	star43 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(calibration_target instrument0 groundstation3)
	(supports instrument1 image4)
	(supports instrument1 image0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 star6)
	(calibration_target instrument1 groundstation3)
	(calibration_target instrument1 star4)
	(supports instrument2 image4)
	(calibration_target instrument2 star4)
	(calibration_target instrument2 star1)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(calibration_target instrument3 groundstation0)
	(calibration_target instrument3 groundstation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet40)
	(supports instrument4 image4)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 groundstation11)
	(calibration_target instrument4 groundstation7)
	(calibration_target instrument4 star1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation8)
	(supports instrument5 image4)
	(supports instrument5 infrared3)
	(calibration_target instrument5 groundstation7)
	(calibration_target instrument5 groundstation15)
	(calibration_target instrument5 star4)
	(supports instrument6 image0)
	(calibration_target instrument6 groundstation15)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet19)
	(supports instrument7 spectrograph1)
	(supports instrument7 image4)
	(supports instrument7 image0)
	(calibration_target instrument7 star6)
	(calibration_target instrument7 groundstation7)
	(calibration_target instrument7 groundstation8)
	(supports instrument8 spectrograph1)
	(supports instrument8 image4)
	(calibration_target instrument8 groundstation11)
	(calibration_target instrument8 groundstation2)
	(calibration_target instrument8 star1)
	(calibration_target instrument8 star4)
	(calibration_target instrument8 groundstation9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet37)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 star4)
	(calibration_target instrument9 groundstation5)
	(supports instrument10 image0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 groundstation7)
	(calibration_target instrument10 star4)
	(calibration_target instrument10 star6)
	(calibration_target instrument10 groundstation13)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet19)
	(supports instrument11 infrared3)
	(supports instrument11 spectrograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 groundstation5)
	(calibration_target instrument11 star6)
	(calibration_target instrument11 groundstation13)
	(supports instrument12 spectrograph1)
	(supports instrument12 image0)
	(calibration_target instrument12 groundstation15)
	(calibration_target instrument12 groundstation14)
	(supports instrument13 image4)
	(calibration_target instrument13 groundstation3)
	(calibration_target instrument13 groundstation9)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 planet35)
	(supports instrument14 image0)
	(supports instrument14 image4)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 star6)
	(calibration_target instrument14 groundstation8)
	(calibration_target instrument14 groundstation5)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 star4)
	(calibration_target instrument15 groundstation7)
	(calibration_target instrument15 groundstation9)
	(calibration_target instrument15 groundstation3)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 star10)
)
(:goal (and
	(pointing satellite0 groundstation9)
	(pointing satellite1 groundstation12)
	(pointing satellite4 star31)
	(have_image phenomenon17 spectrograph2)
	(have_image planet18 image4)
	(have_image planet19 spectrograph2)
	(have_image planet20 spectrograph1)
	(have_image star21 image4)
	(have_image planet22 spectrograph1)
	(have_image phenomenon23 image4)
	(have_image star24 image4)
	(have_image star25 infrared3)
	(have_image phenomenon26 image0)
	(have_image star28 spectrograph2)
	(have_image planet29 image4)
	(have_image star30 image4)
	(have_image star31 infrared3)
	(have_image phenomenon33 image4)
	(have_image planet35 image0)
	(have_image planet36 spectrograph1)
	(have_image planet37 image0)
	(have_image phenomenon38 spectrograph2)
	(have_image star39 spectrograph1)
	(have_image planet40 image4)
	(have_image star41 spectrograph1)
	(have_image planet42 spectrograph1)
	(have_image star43 image4)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite4 star31 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star31)
   goals met: 1 of 27
2. (turn_to satellite1 groundstation12 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation12)
   goals met: 2 of 27
3. (switch_on instrument15 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument15)
   goals met: 2 of 27
4. (turn_to satellite6 star28 star10)
   deleted: (pointing satellite6 star10)
   added: (pointing satellite6 star28)
   goals met: 2 of 27
5. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 2 of 27
6. (turn_to satellite0 groundstation9 planet40)
   deleted: (pointing satellite0 planet40)
   added: (pointing satellite0 groundstation9)
   goals met: 3 of 27
7. (turn_to satellite3 phenomenon23 planet37)
   deleted: (pointing satellite3 planet37)
   added: (pointing satellite3 phenomenon23)
   goals met: 3 of 27
8. (switch_on instrument12 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument12)
   goals met: 3 of 27
9. (turn_to satellite5 groundstation15 planet35)
   deleted: (pointing satellite5 planet35)
   added: (pointing satellite5 groundstation15)
   goals met: 3 of 27
10. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 27
11. (turn_to satellite2 groundstation7 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 groundstation7)
   goals met: 3 of 27
12. (turn_to satellite6 groundstation3 star28)
   deleted: (pointing satellite6 star28)
   added: (pointing satellite6 groundstation3)
   goals met: 3 of 27
13. (calibrate satellite2 instrument5 groundstation7)
   added: (calibrated instrument5)
   goals met: 3 of 27
14. (turn_to satellite2 phenomenon23 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon23)
   goals met: 3 of 27
15. (calibrate satellite5 instrument12 groundstation15)
   added: (calibrated instrument12)
   goals met: 3 of 27
16. (turn_to satellite5 phenomenon26 groundstation15)
   deleted: (pointing satellite5 groundstation15)
   added: (pointing satellite5 phenomenon26)
   goals met: 3 of 27
17. (calibrate satellite6 instrument15 groundstation3)
   added: (calibrated instrument15)
   goals met: 3 of 27
18. (turn_to satellite6 phenomenon17 groundstation3)
   deleted: (pointing satellite6 groundstation3)
   added: (pointing satellite6 phenomenon17)
   goals met: 3 of 27
19. (take_image satellite2 phenomenon23 instrument5 image4)
   added: (have_image phenomenon23 image4)
   goals met: 4 of 27
20. (take_image satellite5 phenomenon26 instrument12 image0)
   added: (have_image phenomenon26 image0)
   goals met: 5 of 27
21. (take_image satellite6 phenomenon17 instrument15 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 6 of 27
22. (turn_to satellite2 phenomenon33 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 phenomenon33)
   goals met: 6 of 27
23. (turn_to satellite5 planet20 phenomenon26)
   deleted: (pointing satellite5 phenomenon26)
   added: (pointing satellite5 planet20)
   goals met: 6 of 27
24. (take_image satellite2 phenomenon33 instrument5 image4)
   added: (have_image phenomenon33 image4)
   goals met: 7 of 27
25. (turn_to satellite6 phenomenon38 phenomenon17)
   deleted: (pointing satellite6 phenomenon17)
   added: (pointing satellite6 phenomenon38)
   goals met: 7 of 27
26. (take_image satellite5 planet20 instrument12 spectrograph1)
   added: (have_image planet20 spectrograph1)
   goals met: 8 of 27
27. (take_image satellite6 phenomenon38 instrument15 spectrograph2)
   added: (have_image phenomenon38 spectrograph2)
   goals met: 9 of 27
28. (turn_to satellite2 planet18 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 planet18)
   goals met: 9 of 27
29. (turn_to satellite5 planet22 planet20)
   deleted: (pointing satellite5 planet20)
   added: (pointing satellite5 planet22)
   goals met: 9 of 27
30. (take_image satellite2 planet18 instrument5 image4)
   added: (have_image planet18 image4)
   goals met: 10 of 27
31. (turn_to satellite6 planet19 phenomenon38)
   deleted: (pointing satellite6 phenomenon38)
   added: (pointing satellite6 planet19)
   goals met: 10 of 27
32. (take_image satellite5 planet22 instrument12 spectrograph1)
   added: (have_image planet22 spectrograph1)
   goals met: 11 of 27
33. (take_image satellite6 planet19 instrument15 spectrograph2)
   added: (have_image planet19 spectrograph2)
   goals met: 12 of 27
34. (turn_to satellite2 planet29 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet29)
   goals met: 12 of 27
35. (turn_to satellite5 planet35 planet22)
   deleted: (pointing satellite5 planet22)
   added: (pointing satellite5 planet35)
   goals met: 12 of 27
36. (take_image satellite2 planet29 instrument5 image4)
   added: (have_image planet29 image4)
   goals met: 13 of 27
37. (take_image satellite5 planet35 instrument12 image0)
   added: (have_image planet35 image0)
   goals met: 14 of 27
38. (turn_to satellite6 star28 planet19)
   deleted: (pointing satellite6 planet19)
   added: (pointing satellite6 star28)
   goals met: 14 of 27
39. (take_image satellite6 star28 instrument15 spectrograph2)
   added: (have_image star28 spectrograph2)
   goals met: 15 of 27
40. (turn_to satellite5 planet36 planet35)
   deleted: (pointing satellite5 planet35)
   added: (pointing satellite5 planet36)
   goals met: 15 of 27
41. (turn_to satellite2 planet40 planet29)
   deleted: (pointing satellite2 planet29)
   added: (pointing satellite2 planet40)
   goals met: 15 of 27
42. (take_image satellite5 planet36 instrument12 spectrograph1)
   added: (have_image planet36 spectrograph1)
   goals met: 16 of 27
43. (take_image satellite2 planet40 instrument5 image4)
   added: (have_image planet40 image4)
   goals met: 17 of 27
44. (turn_to satellite5 planet37 planet36)
   deleted: (pointing satellite5 planet36)
   added: (pointing satellite5 planet37)
   goals met: 17 of 27
45. (turn_to satellite2 star21 planet40)
   deleted: (pointing satellite2 planet40)
   added: (pointing satellite2 star21)
   goals met: 17 of 27
46. (take_image satellite5 planet37 instrument12 image0)
   added: (have_image planet37 image0)
   goals met: 18 of 27
47. (take_image satellite2 star21 instrument5 image4)
   added: (have_image star21 image4)
   goals met: 19 of 27
48. (turn_to satellite5 planet42 planet37)
   deleted: (pointing satellite5 planet37)
   added: (pointing satellite5 planet42)
   goals met: 19 of 27
49. (turn_to satellite2 star24 star21)
   deleted: (pointing satellite2 star21)
   added: (pointing satellite2 star24)
   goals met: 19 of 27
50. (take_image satellite5 planet42 instrument12 spectrograph1)
   added: (have_image planet42 spectrograph1)
   goals met: 20 of 27
51. (take_image satellite2 star24 instrument5 image4)
   added: (have_image star24 image4)
   goals met: 21 of 27
52. (turn_to satellite2 star25 star24)
   deleted: (pointing satellite2 star24)
   added: (pointing satellite2 star25)
   goals met: 21 of 27
53. (turn_to satellite5 star39 planet42)
   deleted: (pointing satellite5 planet42)
   added: (pointing satellite5 star39)
   goals met: 21 of 27
54. (take_image satellite2 star25 instrument5 infrared3)
   added: (have_image star25 infrared3)
   goals met: 22 of 27
55. (take_image satellite5 star39 instrument12 spectrograph1)
   added: (have_image star39 spectrograph1)
   goals met: 23 of 27
56. (turn_to satellite2 star30 star25)
   deleted: (pointing satellite2 star25)
   added: (pointing satellite2 star30)
   goals met: 23 of 27
57. (turn_to satellite5 star41 star39)
   deleted: (pointing satellite5 star39)
   added: (pointing satellite5 star41)
   goals met: 23 of 27
58. (take_image satellite2 star30 instrument5 image4)
   added: (have_image star30 image4)
   goals met: 24 of 27
59. (take_image satellite5 star41 instrument12 spectrograph1)
   added: (have_image star41 spectrograph1)
   goals met: 25 of 27
60. (turn_to satellite2 star31 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star31)
   goals met: 25 of 27
61. (take_image satellite2 star31 instrument5 infrared3)
   added: (have_image star31 infrared3)
   goals met: 26 of 27
62. (turn_to satellite2 star43 star31)
   deleted: (pointing satellite2 star31)
   added: (pointing satellite2 star43)
   goals met: 26 of 27
63. (take_image satellite2 star43 instrument5 image4)
   added: (have_image star43 image4)
   goals met: 27 of 27
